import Sidebar from "../../_components/Layout/Sidebar";
import Navbar from "../../_components/Layout/Navbar";
import NewsContent from "@/app/_components/NewsContent";
import Hero from "@/app/_components/Layout/Hero";

export default function New({ params }) {
    const { slug } = params;

    const newsData = {
        "ក្រុមហ៊ុនបច្ចេកវិទ្យាយក្សចិន-huawei-សម្រេចបាននូវសមិទ្ធផលថ្មីដ៏សំខាន់មួយរបស់-ប្រព័ន្ធ-ads-qiankun-1": {
            published_at: "2025-10-02T09:00:00.000Z",
            title: `ក្រុមហ៊ុនបច្ចេកវិទ្យាយក្សចិន Huawei សម្រេចបាននូវសមិទ្ធផលថ្មីដ៏សំខាន់មួយរបស់ ប្រព័ន្ធ ADS "Qiankun"`,
            featured_image: {
                url: "/image/news/files-1759315271889-830589414.jpg",
                alt: `ក្រុមហ៊ុនបច្ចេកវិទ្យាយក្សចិន Huawei សម្រេចបាននូវសមិទ្ធផលថ្មីដ៏សំខាន់មួយរបស់ ប្រព័ន្ធ ADS "Qiankun"`,
                thumbnail: "/image/news/resized-file-1759388078259-637898202.jpg"
            },
            source: "ArenaEV",
            author: {
                id: "",
                name: "AC Auto",
                avatar: "",
                bio: "",
                slug: ""
            },
            translator: {
                type: "human",
                name: "ផាកឃឺ",
                id: "",
                verified: true
            },
            content: `<p>
                        នៅក្នុងពេលដែលក្រុមហ៊ុនជាច្រើនក្នុងវិស័យយានយន្តអគ្គិសនីនៅតែព្យាយាមស្វែងរកវិធីសាស្រ្តដើម្បីធ្វើឲ្យរថយន្តរបស់ខ្លួនកាន់តែមានភាពទាក់ទាញ ក្រុមហ៊ុន Huawei ហាក់ដូចជាបានដើរទៅមុខមួយលានជំហានរួចទៅហើយ។ ក្រុមហ៊ុនបច្ចេកវិទ្យាយក្សរបស់ចិនមួយនេះបានប្រកាសថា ប្រព័ន្ធបើកបរបែបទំនើបរបស់ខ្លួន ដែលត្រូវបានគេស្គាល់ថា “Qiankun” ត្រូវបានដំឡើងនៅក្នុងរថយន្តជាងមួយលានគ្រឿងរួចទៅហើយ។ នេះបើតាមប្រសាសន៍របស់លោក Jin Yuzhi ប្រធានផ្នែករថយន្តឆ្លាតវៃរបស់ Huawei ក្នុងអំឡុងព្រឹត្តការណ៏បច្ចេកវិទ្យារថាមពលថយន្តពិភពលោក ២០២៥(2025 World New Energy Vehicle Congress)។
                    </p>

                    <img src="/image/news/files-1759315271879-312390002.jpg" alt="Full Width Banner" style="width:100%;max-width:1200px;height: auto;border-radius:6px;display:block;margin-bottom:15px;" />
                    <p>
                        ប្រព័ន្ធ Qiankun គឺជាឈុតបច្ចេកវិទ្យាដ៏ទំនើបដែលជួយក្នុងការបើកបរ ការចតរថយន្ត ដោយសុវត្ថិភាព។ ប្រព័ន្ធ God's Eye ADS ថ្មីគឺជាផ្នែកសំខាន់មួយនៃបច្ចេកវិទ្យា Qiankun ដ៏ធំ។ រហូតមកដល់ពេលនេះ រថយន្តដែលបំពាក់ដោយប្រព័ន្ធនេះបានធ្វើដំណើរបានចម្ងាយជាង ៥ ពាន់លានគីឡូម៉ែត្រដោយមានជំនួយពីវា។ ចម្ងាយនេះគឺប្រៀបដូចជាការបើកបរទៅកាន់ភពព្រះអាទិត្យហើយត្រឡប់មកវិញច្រើនជាង ១៦.   ដង។
                    </p>

                    <img src="/image/news/files-1759315271860-693653762.jpg" alt="Full Width Banner" style="width:100%;max-width:1200px;height: auto;border-radius:6px;display:block;margin-bottom:15px;" />
                    <p>
                        ក្នុងអំឡុងពេលនេះ ប្រព័ន្ធសុំចតរថយន្តដោយស្វ័យប្រវត្តិអាចលើសជាង ២៨០ លានដង ហើយត្រូវបានគេជឿថាវាបានការពារគ្រោះថ្នាក់ដែលទំនងជាអាចកើតមានឡើងរហូតទៅដល់ជាង ២,៧១ លានលើក។ តួរលេខទាំងនេះ យោងទៅតាមក្រុមហ៊ុនបច្ចេកវិទ្យាយក្សចិនមួយនេះ គឺបានឧទាហរណ៍ជាក់ស្តែងដែលបច្ចេកវិទ្យាអាចជួយសង្គ្រោះជីវិត និងការពារការខូចខាត។
                    </p>
                    <p>
                        Huawei បានចាប់ដៃគូជាមួយក្រុមហ៊ុនផលិតរថយន្តជាច្រើនដើម្បីរួមបញ្ចូលប្រព័ន្ធរបស់ខ្លួន។ ម៉ាកយីហោដូចជា Avatr, Deepal និង Voyah គឺជាម៉ាកយីហោមួយចំនួនក្នុងចំណោមម៉ាកយីហោដែលបានប្រើប្រាស់ដំបូងគេ។ ការប្រើប្រាស់យ៉ាងទូលំទូលាយនេះនៅលើម៉ូដែលផ្សេងៗគ្នាដែលមានចំនួនរហូតដល់ ២៨ម៉ូដែល បានបង្ហាញថា Huawei មានភាពម៉ឺងម៉ាត់អំពីឧស្សាហកម្មរថយន្តអគ្គិសនី មិនមែនដោយការផលិតរថយន្តផ្ទាល់ខ្លួនទេ ប៉ុន្តែដោយការផ្តល់បច្ចេកវិទ្យាខួរក្បាល (chip) ដើម្បីដំណើរការពួកវា។ ផ្នែក cockpit ដែលដំណើរការដោយ HarmonyOS ដែលជាផ្នែកដ៏សំខាន់នៃប្រព័ន្ធនេះ ក៏បានទទួលការប្រើប្រាស់គួរឱ្យចាប់អារម្មណ៍ផងដែរ ដោយមុខងារជំនួយសំឡេងរបស់វាត្រូវបានដំណើរការ ២៣៨ លានដង។
                    </p>

                    <img src="/image/news/files-1759315271874-729759179.jpg" alt="Full Width Banner" style="width:100%;max-width:1200px;height: auto;border-radius:6px;display:block;margin-bottom:15px;" />
                    <p>
                        លោក Jin Yuzhi ក៏បានចែករំលែកចក្ខុវិស័យរបស់ Huawei សម្រាប់អនាគតកាលផងដែរ នៃការបើកបរ ដែលលោកបានរៀបរាប់ក្នុង “បីដំណាក់កាល”។ ដំណាក់កាលទី១៖ ចាប់ពីឆ្នាំ ២០១៥ ដល់ឆ្នាំ ២០២២ គឺផ្តោតលើការប្រើប្រាស់ថាមពលអគ្គិសនី ដែលជំនួសសាំងដោយអគ្គិសនីដែលមានតម្លៃថោក និងស្អាតជាង។ បច្ចុប្បន្នយើងស្ថិតនៅក្នុងដំណាក់កាលទី២ ដែលចាប់ពីឆ្នាំ ២០២២ ដល់ឆ្នាំ ២០២៧។ ដំណាក់កាលនេះផ្តោតលើ “ភាពឆ្លាតវៃ” ដែលជាក្បួនដោះស្រាយភាពឆ្លាតវៃធ្វើឱ្យការបើកបរកាន់តែមានសុវត្ថិភាព និងមិនសូវមានភាពតានតឹង។
                    </p>
                    <p>
                        ដំណាក់កាលទី៣៖ដែលគ្រោងនឹងចាប់ផ្តើមនៅឆ្នាំ ២០២៧ គឺ “ស្វ័យប្រវត្តិកម្ម”។ នេះគឺជាពេលដែលអ្វីៗកាន់តែគួរឱ្យចាប់អារម្មណ៍ជាមួយនឹងរថយន្តដែលអាចបើកបរដោយខ្លួនឯង ដែលអាចផ្លាស់ប្តូររបៀបដែលយើងគិតអំពីការដឹកជញ្ជូន។ ដើម្បីឈានទៅដល់អនាគតស្វ័យប្រវត្តិកម្មនេះរបស់ក្រុមហ៊ុន Huawei គឺមានផែនការច្បាស់លាស់។
                    </p>

                    <img src="/image/news/files-1759315271884-606118015.jpg" alt="Full Width Banner" style="width:100%;max-width:1200px;height: auto;border-radius:6px;display:block;margin-bottom:15px;" />
                    <p>
                        មុនដំណាច់ឆ្នាំ ២០២៥ ក្រុមហ៊ុននឹងចេញប្រព័ន្ធ ADS 4 របស់ខ្លួន ដែលនឹងណែនាំមុខងារបើកបរស្វយ័តកម្រិត ៣ (L3) សម្រាប់ផ្លូវហាយវេ។ L3 មានន័យថា រថយន្តអាចគ្រប់គ្រងកិច្ចការបើកបរភាគច្រើននៅលើផ្លូវហាយវេ ប៉ុន្តែអ្នកបើកបរត្រូវតែត្រៀមខ្លួនដើម្បីគ្រប់គ្រងវិញប្រសិនបើចាំបាច់។ នៅឆ្នាំ ២០២៦ Huawei រំពឹងថានឹងឃើញរថយន្តជាច្រើនទៀតដែលមានសមត្ថភាព L3 នៅលើផ្លូវ ហើយថែមទាំងនឹងចាប់ផ្តើមសាកល្បងប្រព័ន្ធកម្រិត ៤ (L4) នៅក្នុងទីក្រុង។ L4 គឺជាជំហានដ៏ធំមួយដែលរថយន្តអាចបើកបរដោយខ្លួនឯងនៅក្នុងតំបន់ជាក់លាក់ដោយគ្មានការអន្តរាគមន៍ រឹ ការបើកបរពីមនុស្សឡើយ។
                    </p>
                    <p>
                        នៅឆ្នាំ ២០២៧ នៅពេលដែលផ្លូវហាយវេ និងផ្លូវក្នុងទីក្រុងកាន់តែច្រើនត្រូវបានគូសផែនទីសម្រាប់មុខងារ Navigation Cruise Assist របស់ខ្លួន Huawei ជឿថា L3 នឹងក្លាយជារឿងធម្មតា។ ក្នុងពេលជាមួយគ្នានេះ បច្ចេកវិទ្យា L4 នឹងចាប់ផ្តើមត្រូវបានប្រើប្រាស់ជាលក្ខណៈពាណិជ្ជកម្ម ដោយត្រួសត្រាយផ្លូវសម្រាប់រថយន្ត Robotaxis និងរថយន្តដឹកជញ្ជូនស្វ័យប្រវត្តិកម្ម។
                    </p>`
        },
        "រថយន្តអគ្គិសនីរបស់ក្រុមហ៊ុន-byd-2": {
            published_at: "2025-10-02T03:00:00.000Z",
            title: "រថយន្តអគ្គិសនីរបស់ក្រុមហ៊ុន BYD រំពឹងថាការលក់នៅក្រៅប្រទេសនឹងកើនឡើងដល់ ២០% នៃការលក់សរុបនៅឆ្នាំ ២០២៥។",
            featured_image: {
                url: "/image/news/file-1759392271468-36349769.jpg",
                alt: "រថយន្តអគ្គិសនីរបស់ក្រុមហ៊ុន BYD រំពឹងថាការលក់នៅក្រៅប្រទេសនឹងកើនឡើងដល់ ២០% នៃការលក់សរុបនៅឆ្នាំ ២០២៥។",
                thumbnail: "/image/news/resized-file-1759393685889-250336739.jpg"
            },
            source: "រ៉យទ័រ",
            author: {
                id: "",
                name: "AC auto",
                avatar: "",
                bio: "",
                slug: ""
            },
            translator: {
                type: "human",
                name: "ខេន ផាកឃឺ",
                id: "",
                verified: true
            },
            content: `<p>
                        នេះបើតាមការចុះផ្សាយរបស់កាសែត South China Morning Post។ គេបានប៉ាន់ប្រមាណថា ក្រុមហ៊ុនផលិតរថយន្តនេះ នឹងធ្វើការនាំចេញថយន្តចន្លោះពី ៨០ ម៉ឺន ទៅ ១ លានគ្រឿងទៅកាន់បរទេស ក្រៅពីក្នុងស្រុក នៅឆ្នាំនេះ ដែលប្រហែល ២០% នៃការលក់សរុបទូទាំងពិភពលោក ដែលបានព្យាករណ៍ទុកគឺ ៤,៦ លានគ្រឿង។
                    </p>

                    <img src="/image/news/file-1759393781055-255696658.jpg" alt="Full Width Banner" style="width:100%;max-width:1200px;height: auto;border-radius:6px;display:block;margin-bottom:15px;" />
                    <p>
                        ទោះជាយ៉ាងណាក៏ដោយ ការព្យាករណ៍ ៤,៦ លានគ្រឿង ត្រូវបានកែសម្រួលចុះ ១៦% ដោយសារ BYD កំពុងប្រឈមមុខនឹងកំណើនប្រចាំឆ្នាំយឺតបំផុតក្នុងរយៈពេល ៥ ឆ្នាំចុងក្រោយនេះ។ ស្ថានភាពនេះហាក់ដូចជាស្របទៅនឹងការលក់រថយន្ត EV នៅប្រទេសចិនដែលកំពុងមានការថយចុះ។ នេះជាលទ្ធផល របស់អ្នកវិភាគជឿថា ការនាំចេញរបស់ BYD នឹងចូលរួមចំណែកកាន់តែច្រើននាពេលអនាគត។
                    </p>

                    <p>
                        កិច្ចខិតខំប្រឹងប្រែងជាសកលរបស់ BYD បានពន្យល់ពីបញ្ហានេះបន្ថែមទៀត។ ក្រុមហ៊ុនថ្មីៗនេះបានប្តេជ្ញាថា រថយន្ត BYD គ្រប់គ្រឿងដែលលក់នៅអឺរ៉ុប នឹងត្រូវផលិតនៅក្នុងទ្វីបអឺរ៉ុបនេះនៅឆ្នាំ ២០២៨។ ក្រុមហ៊ុនផលិតរថយន្តរបស់ចិនមួយនេះ ថែមទាំងបានយកឈ្នះក្រុមហ៊ុន Tesla នៅអឺរ៉ុបកាលពីខែកក្កដាកន្លងទៅ។ ភាពជោគជ័យមួយផ្នែករបស់ BYD នោះ គឺដោយសារមាននាវារដឹកជញ្ជូនរថយន្តផ្ទាល់ខ្លួន។
គួរបញ្ជាក់ថា នៅក្នុងឆ្នាំ ២០២៤ ការនាំចេញរបស់រថយន្ត BYD មានចំនួនតិចជាង ១០% នៃការនាំចេញសរុបរបស់ខ្លួន។
                    </p>`
        },
        "mazda-បង្ហាញរថយន្ត-suv-អគ្គិសនី-ez-60-ជាមួយនឹងជម្រើសម៉ាស៊ីនពីរប្រភេទ។-3": {
            published_at: "2025-10-01T03:00:00.000Z",
            title: "Mazda បង្ហាញរថយន្ត SUV អគ្គិសនី EZ-60 ជាមួយនឹងជម្រើសម៉ាស៊ីនពីរប្រភេទ។",
            featured_image: {
                url: "/image/news/file-1759401962173-711743282.jpg",
                alt: "Mazda បង្ហាញរថយន្ត SUV អគ្គិសនី EZ-60 ជាមួយនឹងជម្រើសម៉ាស៊ីនពីរប្រភេទ។",
                thumbnail: "/image/news/resized-file-1759401797655-925493902.jpg"
            },
            source: "ArenaEV",
            author: {
                id: "",
                name: "AC Auto",
                avatar: "",
                bio: "Senior Software Engineer",
                slug: ""
            },
            translator: {
                type: "human",
                name: "ផាកឃឺ",
                id: "",
                verified: true
            },
            content: `<p>
                        រថយន្តអគ្គិសនីស៊េរីចុងក្រោយបំផុតរបស់ក្រុមហ៊ុន Mazda គឺម៉ូដែល EZ-60 ទើបតែត្រូវបានដាក់បង្ហាញនៅប្រទេសចិន ហើយនឹងបង្ហាញខ្លួនជាសកលនៅឆ្នាំ ២០២៦ ក្រោមឈ្មោះផ្សេងគឺ Mazda CX-6e។ រថយន្ត SUV អគ្គិសនីទំហំមធ្យមនេះ និងចូលទីផ្សារប្រកួតប្រជែងយ៉ាងខ្លាំងក្លាជាមួយនឹងយុទ្ធសាស្ត្រតម្លៃដ៏ទាក់ទាញ ជាមួយនិងជម្រើសប្រភេទម៉ាស៊ីនពីរផ្សេងគ្នា ដែលផ្តល់ជម្រើសទៅដល់អ្នកទិញដែលជាគូប្រកួតប្រជែងជាច្រើនគ្មានដូច។
                    </p>

                    <p>
                        រថយន្ត EZ-60 គឺជា EV ជំនាន់ថ្មីទី ២ ពីក្រុមហ៊ុន Mazda ដែលបានបង្ហាញខ្លួននៅក្នុងប្រទេសចិន បន្ទាប់ពីរថយន្ត Mazda EZ-6។ រថយន្តទាំងពីរនេះ គឺជាលទ្ធផលនៃភាពជាដៃគូជាមួយក្រុមហ៊ុនផលិតរថយន្តចិន Changan ហើយត្រូវបានសាងសង់នៅលើស្ថាបត្យកម្ម EPA របស់ខ្លួន។ កិច្ចសហការនេះអនុញ្ញាតឱ្យក្រុមហ៊ុន Mazda ផ្តល់ជូនរថយន្ត SUV នេះជាពីរប្រភេទ៖ ម៉ូដែលអគ្គិសនីសុទ្ធ និងម៉ូដែល 
                    </p>

                    <img src="/image/news/file-1759401720307-219201169.jpg" alt="Range-extended Hybrid" style="width:100%;max-width:1200px;height: auto;border-radius:6px;display:block;" />
                    <strong>Range-extended Hybrid។</strong>
                    <p style="color:#333;margin-top:15px;margin-bottom:20px;text-align:left;">
                        សម្រាប់ទីផ្សារប្រទេសចិន វាមានតម្លៃគឺទាបគួរឱ្យកត់សម្គាល់ ដោយមានចន្លោះពី  119,900 យន់ ទៅ 160,900 យន់។ តាមអត្រាប្តូរប្រាក់បច្ចុប្បន្ន វាមានតម្លៃប្រហែល  14,300 អឺរ៉ូ ទៅ 19,300 អឺរ៉ូ និង 16,700ដុល្លា ទៅ 22,600ដុល្លា។ តម្លៃទីផ្សារអន្តរជាតិនឹងខុសគ្នាពិតណាស់ ប៉ុន្តែតម្លៃចាប់ផ្តើមនេះគឺមានភាពទាក់ទាញគ្រប់គ្រាន់ដើម្បីទាក់ទាញចំណាប់អារម្មណ៍របស់អតិថិជនគ្រប់រូប ដោយមិនគិតពីប្រទេសដែលពួកគេរស់នៅឡើយ។
                    </p>
                    <p>
                        បើក្រឡេកមើលរូបរាងខាងក្រៅ រថយន្ត SUV នេះមិនអាចច្រឡំឡើយថាជារថយន្ត Mazda។ វាមានទស្សនៈរចនាដ៏ពិសេសរបស់ម៉ាកយីហោនេះ ដែលត្រូវបានកែសម្រួលសម្រាប់យុគសម័យរថយន្តអគ្គិសនី EV។ ផ្នែកខាងមុខមានClosed-off grille common ដែលជារឿងធម្មតាចំពោះរថយន្តអគ្គិសនីជាច្រើន ប៉ុន្តែមានភាព
                    </p>

                    <img src="/image/news/file-1759402010296-878716079.jpg" alt="Full Width Banner" style="width:100%;max-width:1200px;height: auto;border-radius:6px;display:block;margin-bottom:15px;" />
                    <p>
                        ប្លែកត្រង់មាននិមិត្តសញ្ញា Mazda ដែលអាចបញ្ចេញពន្លឺបាន។ ភ្លើងបំភ្លឺពេលថ្ងៃ (DRL) ស្តើង និងចង្កៀងមុខដែលញែកគ្នា ផ្តល់ឱ្យវានូវរូបរាងបែបទំនើប និងទាន់សម័យ។
                    </p>
                    <p>
                        ជាមួយនឹងប្រវែង ៤,៨៥០ ម.ម ទទឹង ១,៩៣៥ ម.ម និងកម្ពស់ ១,៦២០ ម.ម ព្រមទាំង wheelbase ២,៩០២ ម.ម វិមាត្ររបស់រថយន្តនេះដាក់វាចូលក្នុងប្រភេទទំហំមធ្យម។ លក្ខណៈពិសេសមួយចំនួនទៀតដូចជា ដៃទ្វារលាក់ កញ្ចក់ចំហៀងអេឡិចត្រូនិច និងកង់ទំហំ ១៩ អ៊ីញស្តង់ដារ (ជាមួយនឹងជម្រើសកង់ទំហំ ២១ អ៊ីញ) ធ្វើឱ្យរូបរាងទាំងមូលមានភាពស្រស់ស្អាត និងទាន់សម័យ។
                    </p>

                    <p>
                        អតិថិជនអាចជ្រើសរើសប្រភេទម៉ាស៊ីនដែលសាកសមបំផុតទៅនឹងតម្រូវការរបស់ពួកគេ។ ម៉ូដែលអគ្គិសនីសុទ្ធ គឺជាប្រភេទ EV បើកបរដោយកង់ក្រោយដែលប្រើម៉ូទ័រទំហំ ១៩០ kW តែមួយ។ វាប្រើអាគុយ Lithium-iron-phosphate (LFP) ទំហំ ៧៧,៩៤ kWh ដែលមានចម្ងាយធ្វើដំណើរ ៦០០ គីឡូម៉ែត្រ ផ្អែកលើការសាកល្បង CLTC របស់ប្រទេសចិន។
                    </p>
                    <p>
                        ជម្រើសទីពីរគឺប្រភេទ Range-extended EV ដែលប្រើម៉ូទ័រអគ្គិសនីទំហំ ១៩០ kW ដូចគ្នា ប៉ុន្តែភ្ជាប់មកជាមួយអាគុយទំហំតូចជាងគឺ ៣១,៧៣ kWh និងម៉ាស៊ីនសាំងទំហំ ១,៥ លីត្រ ដែលដើរតួជាម៉ាស៊ីនភ្លើងតែប៉ុណ្ណោះ។ ម៉ូដែលនេះផ្តល់នូវចម្ងាយបើកបរអគ្គិសនីសុទ្ធ ២០០ គីឡូម៉ែត្រ មុនពេលម៉ាស៊ីនភ្លើងសាំងដំណើរការដើម្បីបញ្ចូលថាមពលអាគុយឡើងវិញ ដែលពង្រីកចម្ងាយសរុបរបស់វាដល់ជាង ១,០០០ គីឡូម៉ែត្រ។
                    </p>

                    <img src="/image/news/file-1759402045246-362728843.jpg" alt="Full Width Banner" style="width:100%;max-width:1200px;height: auto;border-radius:6px;display:block;margin-bottom:15px;" />
                    <p>
                        ផ្ទៃខាងក្នុងរបស់ EZ-60 មានភាពខុសប្លែកគ្នាយ៉ាងខ្លាំងពីកាប៊ីនបែបប្រពៃណីរបស់ Mazda ដោយផ្អែកលើបច្ចេកវិទ្យាទំនើប។ ចំណុចកណ្តាលគឺអេក្រង់កណ្តាលទំហំ ២៦.៤៥ អ៊ីញប្រភេទ 5K ដែលដំណើរការដោយ CPU 4nm ដ៏ទំនើបសម្រាប់ដំណើរការរហ័ស។ មុខងារ Augmented Reality Head-Up Display (AR-HUD) ទំហំ ៥០ អ៊ីញ គឺជាស្តង់ដារ ដែលបង្ហាញព័ត៌មានសំខាន់ៗដោយផ្ទាល់លើកញ្ចក់ខាងមុខ។
                    </p>
                    <p>
                        សម្រាប់អតិថិជនដែលចង់បានបទពិសោធន៍បែបអនាគតជាងនេះ មុខងារ 3D-HUD ទំហំ ១០០ អ៊ីញ អាចរកបានជាជម្រើសបន្ថែម។ ភាពងាយស្រួលត្រូវបានផ្តល់ជូនដោយកៅអីខាងមុខ "zero-gravity" ដែលផ្តល់មុខងារកម្តៅ ខ្យល់ចេញចូល និងម៉ាស្សា។ ប្រព័ន្ធសំឡេង premium ទំហំ ២៣ ឧបករណ៍បំពងសម្លេង ជាមួយនឹងការគាំទ្រ Dolby Atmos ផ្តល់នូវបទពិសោធន៍ស្តាប់ដ៏អស្ចារ្យ។
                    </p>

                    <img src="/image/news/file-1759402024247-141076885.jpg" alt="Full Width Banner" style="width:100%;max-width:1200px;height: auto;border-radius:6px;display:block;margin-bottom:15px;" />
                    <p>
                        ដូចទៅនឹងរថយន្ត EV ថ្មីៗភាគច្រើននៅក្នុងប្រទេសចិន រថយន្ត EZ-60 ភ្ជាប់មកជាមួយបច្ចេកវិទ្យាជំនួយអ្នកបើកបរ។ Radar និងកាមេរ៉ាជាច្រើនជួយវាផ្តល់នូវមុខងារស្វយ័តកម្រិត ២ រួមទាំង Adaptive Cruise Control, Lane-Keeping Assist និង Automated Parking។ ប្រព័ន្ធនេះក៏គាំទ្រការបើកបរជំនួយដោយnavigation-assisted driving ទាំងនៅលើផ្លូវហាយវេ និងផ្លូវក្នុងទីក្រុងផងដែរ។
                    </p>
                    <img src="/image/news/file-1759402133296-172923127.jpg" alt="Full Width Banner" style="width:100%;max-width:1200px;height: auto;border-radius:6px;display:block;margin-bottom:15px;" />`,
        }
    };

    const news = newsData[decodeURIComponent(slug)];

    const getTimeAgo = (date) => {
        const now = new Date();
        const postDate = new Date(date);
        const diffInMs = now - postDate;
        const diffInHours = Math.floor(diffInMs / (1000 * 60 * 60));

        if (diffInHours < 24) {
            return `${diffInHours} hour${diffInHours !== 1 ? 's' : ''} ago`;
        } else {
            const day = postDate.toLocaleDateString('en-US', {
                timeZone: 'Asia/Phnom_Penh',
                day: '2-digit'
            });

            const month = postDate.toLocaleDateString('en-US', {
                timeZone: 'Asia/Phnom_Penh',
                month: 'long'
            });

            const year = postDate.toLocaleDateString('en-US', {
                timeZone: 'Asia/Phnom_Penh',
                year: 'numeric'
            });

            return `${day} ${month} ${year}`;
        }
    };

    return (
        <main className="main">
            <Navbar />
            <div className="main__container">
                <Sidebar />
                <div className="content">
                    <Hero type="featured-image" src={news?.featured_image ? news.featured_image.url : ""} alt={news ? news.title : ""} />
                    {/* <img src={news?.featured_image ? news.featured_image.url : ""} alt={news?.featured_image ? news.featured_image.alt : ""} className="full-width-image" />
                    <h2 className="full-width-title">{news ? news.title : ""}</h2> */}
                    <p style={{ fontSize: "14px" }}><span>{news?.author.name && news.author.name}</span>, <span>{getTimeAgo(news.published_at)}</span></p>
                    <NewsContent content={news ? news.content : "<p>News article not found.</p>"} />

                    {/* <div className="two-images">
                        <img src="/image/arenaev_0001.jpg" alt="Image 1" />
                        <img src="/image/arenaev_0002.jpg" alt="Image 2" />
                    </div> */}

                    <p style={{ margin: "0" }}><span>ប្រភព៖</span> <span>{news.source || ""}</span></p>
                    <p><span>ប្រែសំរួល៖</span> <span>{news?.translator ? news.translator.name : ""}</span></p>
                </div>
            </div>
        </main>
    );
}
